app/Controllers/Api/BookController.php

    public function listBook()
    {
        $emp = new BookModel();

        //log_message('error', $e->getMessage());

		$response = [
			'status' => 200,
			"error" => false,
			'messages' => 'Book list',
			'data' => $emp->findAll()
---
SELECT *
FROM `books`

			$data['author'] = $input["author"];
			print_r($data);

				$boo->update($book_id, $data);
---
UPDATE `books` SET `isbn` = NULL, `title` = NULL, `description` = NULL, `author` = NULL
WHERE `books`.`id_book` IN ('44')