app/Controllers/Api/EmployeeController.php

	public function listEmployee()
	{
		$emp = new EmployeeModel();

        //log_message('error', $e->getMessage());

		$response = [
			'status' => 200,
			"error" => false,
			'messages' => 'Employee list',
			'data' => $emp->findAll()
		];
---
SELECT *
FROM `employees`

	public function showEmployee($emp_id)
	{
		$emp = new EmployeeModel();

		$data = $emp->find($emp_id);
---
SELECT *
FROM `employees`
WHERE `employees`.`id` = '5'


			$emp = new EmployeeModel();

			if ($emp->find($emp_id)) {
---
SELECT *
FROM `employees`
WHERE `employees`.`id` = '2'

	public function deleteEmployee($emp_id)
	{
		$emp = new EmployeeModel();

		$data = $emp->find($emp_id);

		if (!empty($data)) {

			$emp->delete($emp_id);
---
SELECT *
FROM `employees`
WHERE `employees`.`id` = '3'
DELETE FROM `employees`
WHERE `id` IN ('3')