app/Controllers/Api/OrderController.php

    public function listOrder()
    {
        $builder = $this->db->table('orders');
        $builder->select('*');
        $builder->join('users', 'users.id_user = orders.user_id','left');
        $builder->join('books', 'books.id_book = orders.book_id','left');
        $query = $builder->get();
---
SELECT *
FROM `orders`
LEFT JOIN `users` ON `users`.`id_user` = `orders`.`user_id`
LEFT JOIN `books` ON `books`.`id_book` = `orders`.`book_id`